Examinator/src/InformationRegisters/УчебныеБазыСУЗ/УчебныеБазыСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчебныеБазыСУЗ</name>
  <attributes>
    <name>СпособПодключения</name>
    <type>
      <types>EnumRef.СпособыПодключенияКВнешнейИнформационнойБазеСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>АутентификацияWindowsИнформационнойБазы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяИнформационнойБазыНаСервере</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСервераИнформационнойБазы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогИнформационнойБазы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольИнформационнойБазы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательИнформационнойБазы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресНаВебСервере</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Конфигурация</name>
    <type>
      <types>CatalogRef.ПрограммныеПродуктыСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/СпособыПодключенияКВнешнейИнформационнойБазеСУЗ/СпособыПодключенияКВнешнейИнформационнойБазеСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыПодключенияКВнешнейИнформационнойБазеСУЗ</name>
  <enumValues>
    <name>Сервер</name>
  </enumValues>
  <enumValues>
    <name>Файл</name>
  </enumValues>
  <enumValues>
    <name>ВебСервер</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/InformationRegisters/УчебныеБазыСУЗ/Forms/ФормаЗаписи/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
	
	Если ЗначениеЗаполнено(Запись.СпособПодключения) Тогда
		
		Элементы.ГруппаНастройкиПодключения.Видимость = Истина;
		
		Элементы.ИмяИнформационнойБазыНаСервере.Видимость = ?(Запись.СпособПодключения = Перечисления.СпособыПодключенияКВнешнейИнформационнойБазеСУЗ.Сервер, Истина, Ложь);
		Элементы.ИмяСервераИнформационнойБазы.Видимость = ?(Запись.СпособПодключения = Перечисления.СпособыПодключенияКВнешнейИнформационнойБазеСУЗ.Сервер, Истина, Ложь);
		Элементы.КаталогИнформационнойБазы.Видимость = ?(Запись.СпособПодключения = Перечисления.СпособыПодключенияКВнешнейИнформационнойБазеСУЗ.Файл, Истина, Ложь);
		Элементы.АдресНаВебСервере.Видимость = ?(Запись.СпособПодключения = Перечисления.СпособыПодключенияКВнешнейИнформационнойБазеСУЗ.ВебСервер, Истина, Ложь);
		Элементы.ПользовательИнформационнойБазы.Видимость = ?(Запись.АутентификацияWindowsИнформационнойБазы, Ложь, Истина);
		Элементы.ПарольИнформационнойБазы.Видимость = ?(Запись.АутентификацияWindowsИнформационнойБазы, Ложь, Истина);
		
	Иначе
		
		Элементы.ГруппаНастройкиПодключения.Видимость = Ложь;
		
	КонецЕсли;	
	
	Если Параметры.ОткрытаИзЭлектронногоРесурса Тогда
		
		Элементы.ФормаЗаписатьИЗакрыть.Видимость = Ложь;
		Элементы.ФормаЗаписать.Видимость = Ложь;
		
		Элементы.Пользователь.ТолькоПросмотр = Истина;
		Элементы.Конфигурация.ТолькоПросмотр = Истина;
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция УстановитьПодключениеНаСервере()
	
	Возврат РегистрыСведений.УчебныеБазыСУЗ.УстановитьПодключение(,Запись);
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура СпособПодключенияПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура АутентификацияWindowsИнформационнойБазыПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// КОМАНДЫ

&НаКлиенте
Процедура УстановитьПодключение(Команда)
	
	РезультатПодключения = УстановитьПодключениеНаСервере();
	
	Если РезультатПодключения.ОшибкаПроверки
		ИЛИ РезультатПодключения.ОшибкаПодключения Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатПодключения.КраткоеОписаниеОшибки);
		
	Иначе
		
		Если Параметры.ОткрытаИзЭлектронногоРесурса Тогда
		
			Если Записать() Тогда
				Закрыть(Истина);
			КонецЕсли;
			
		Иначе
			
			ПоказатьПредупреждение(,НСтр("ru = 'Подключение успешно установлено!'"));
			
		КонецЕсли;
			
	КонецЕсли;
	
	
КонецПроцедуры
